USE Tipography

INSERT INTO register
VALUES
(N'admin', N'admin', 1),
(N'Employee1',N'Employee1', 0),
(N'Booker',N'Booker', 2),
(N'Employee2',N'Employee2', 0);

INSERT INTO Employee
VALUES
(N'Васин Андрей Владимирович', 54, N'Директор', '+7 (111) 111-11-11', 40000),
(N'Иванова Анастасия Викторовна',33, N'Печатник', '+7 (222) 222-22-22', 21000),
(N'Калинина Галина Николаевна', 25, N'Печатник', '+7 (333) 333-33-33', 15000),
(N'Божаев Кирилл Сергеевич', 28, N'Печатник', '+7 (444) 444-44-44', 17000),
(N'Коргина Наталья Анатольевна', 42, N'Уборщица', '+7 (555) 555-55-55', 14000);

INSERT INTO Client
VALUES
(N'Иванов Иван Иванович', '+7 (211) 211-21-21', N'ул. Смоленская, 19А', N'Газпром'),
(N'Петров Петр Петрович', '+7 (222) 222-22-22', N'пл. Свободы, 14', N'Сбербанк'),
(N'Малюта Валерий Алексеевич', '+7 (233) 233-23-23', N'ул. Тельмана, 16', N'Alex Fitness'),
(N'Халиков Ильяс Шарипович', '+7 (244) 244-24-24', N'ул. Волоха, 24', N'Smoke Bar'),
(N'Грищенко Михаил Михайлович', '+7 (255) 255-25-25', N'ул. Одесская, 75', N'Wildberries'),
(N'Бабаев Инаил Мехтиевич', '+7 (266) 266-26-26', N'ул. Тельмана, 150Б', N'Додо Пицца');

INSERT INTO Stock
VALUES
(N'Бумага A4', 100),
(N'Баннерная ткань', 20),
(N'Бумага A0', 50),
(N'Картон A4', 90);

INSERT INTO Service
VALUES
(N'Печать брошюры', 30, 1),
(N'Печать визитки', 20, 4),
(N'Печать буклета', 35, 1),
(N'Печать баннера', 5000, 2),
(N'Печать для билборда', 8000, 2),
(N'Печать плакатов', 150, 3);



INSERT INTO Orders
VALUES
(1, 2, 6, '20230612 00:00:00', 100, 3),
(3, 4, 1, '20230322 00:00:00', 500, 1),
(6, 2, 4, '20230310 00:00:00', 10, 2),
(4, 3, 2, '20230130 00:00:00', 250, 4),
(3, 2, 5, '20230801 00:00:00', 1, 2),
(2, 4, 3, '20230227 00:00:00', 1000, 1),
(5, 3, 4, '20230904 00:00:00', 2, 2);


